app/controllers/movies_controller.rb

  def show
    id = params['id']
    @movie = Movie.find(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Lagoa Azul"], ["description", "filme velho"], ["release_date", 2017-01-27 00:00:00 UTC], ["created_at", 2017-01-26 23:10:57 UTC], ["updated_at", 2017-01-26 23:10:57 UTC]]

def edit
  id = params['id']
  @movie = Movie.find(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

def update
  id = params['id']
  @movie = Movie.find(id)
  @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "The Helpff"], ["description", ""], ["updated_at", 2017-01-27 21:19:02 UTC], ["id", 3]]